9/data/attachments/3729da6670927056.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_b9e16bab-8608-4bc4-8d04-c9a69ef54cc2</nif:username>
            <nif:friendToBeAdded>Ronald_next_Friend_38630_8</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>